{
  "folder": "42GpfoYrJBa7iSk9",
  "name": "Wild Surge",
  "_id": "B253k6Z9q6SQsxLR",
  "img": "icons/magic/light/explosion-beam-impact-silhouette.webp",
  "description": "",
  "results": [
    {
      "type": "text",
      "weight": 1,
      "range": [
        1,
        1
      ],
      "drawn": false,
      "_id": "67HnKGDolqMDHrVH",
      "text": "Necrotic energy bursts from you. Each creature of your choice within 30 feet of you takes [[/r 1d12]] necrotic damage, and you gain temporary hit points equal to the sum of the necrotic damage dealt to the creatures not exceeding your barbarian level + Proficiency modifier + Rage Damage. Until your rage ends, when you reduce a creature to 0 hit points, you can gain [[/r 1d12]] + Rage Damage temporary hit points.",
      "img": "icons/svg/d20-black.svg",
      "documentId": null,
      "flags": {},
      "_key": "!tables.results!B253k6Z9q6SQsxLR.67HnKGDolqMDHrVH"
    },
    {
      "type": "text",
      "weight": 1,
      "range": [
        2,
        2
      ],
      "drawn": false,
      "_id": "EqKMmOiXXCSlgmn7",
      "text": "You teleport up to a number of feet equal to 10 x your Rage damage in feet to an unoccupied space you can see. Until your rage ends, you can use this effect again on each of your turns as a bonus action.",
      "img": "icons/svg/d20-black.svg",
      "documentId": null,
      "flags": {},
      "_key": "!tables.results!B253k6Z9q6SQsxLR.EqKMmOiXXCSlgmn7"
    },
    {
      "type": "text",
      "weight": 1,
      "range": [
        3,
        3
      ],
      "drawn": false,
      "_id": "qwYpHjSk3qhmfw3Y",
      "text": "A number of intangible spirit equal to your Rage Damage, which looks like tiny spirits of your choice, appear within 5 feet of creatures of your choice that you can see within 30 feet of you. At the end of the current turn, any number of your spirits of your choice explodes, and each creature within 5 feet of it must succeed on a Dexterity saving throw or take force damage equal the amount rolled on a number of d6 dice equal to your Rage Damage. Creatures can only take damage from one explosion each turn. Until your rage ends, you can use this effect again, summoning any missing spirits up to the maximum, on each of your turns as a bonus action.",
      "img": "icons/svg/d20-black.svg",
      "documentId": null,
      "flags": {},
      "_key": "!tables.results!B253k6Z9q6SQsxLR.qwYpHjSk3qhmfw3Y"
    },
    {
      "type": "text",
      "weight": 1,
      "range": [
        4,
        4
      ],
      "drawn": false,
      "_id": "AdpPAspbHHPF1gjb",
      "text": "Magic infuses one weapon of your choice that you are holding. Until your rage ends, the weapon's damage type changes to force, and it gains the light and thrown properties, with a normal range of 20 feet and a long range of 60 feet. If the weapon leaves your hand, the weapon reappears in your hand at the end of the current turn.",
      "img": "icons/svg/d20-black.svg",
      "documentId": null,
      "flags": {},
      "_key": "!tables.results!B253k6Z9q6SQsxLR.AdpPAspbHHPF1gjb"
    },
    {
      "type": "text",
      "weight": 1,
      "range": [
        5,
        5
      ],
      "drawn": false,
      "_id": "Ml40mmaD5EccpOXD",
      "text": "Whenever a creature deals damage to you before your rage ends, that creature take force damage equal the amount rolled on a number of d6 dice equal to your Rage Damage, as magic lashes out in retribution across any distance.",
      "img": "icons/svg/d20-black.svg",
      "documentId": null,
      "flags": {},
      "_key": "!tables.results!B253k6Z9q6SQsxLR.Ml40mmaD5EccpOXD"
    },
    {
      "type": "text",
      "weight": 1,
      "range": [
        6,
        6
      ],
      "drawn": false,
      "_id": "Vr6xI1VlqMOjayab",
      "text": "Until your rage ends, you are surrounded by multicolored, protective lights; you gain a bonus to your AC equal to your Rage Damage, and while within 10 feet of you, your allies gain the same bonus.",
      "img": "icons/svg/d20-black.svg",
      "documentId": null,
      "flags": {},
      "_key": "!tables.results!B253k6Z9q6SQsxLR.Vr6xI1VlqMOjayab"
    },
    {
      "type": "text",
      "weight": 1,
      "range": [
        7,
        7
      ],
      "drawn": false,
      "_id": "wEP3wLZtG9lj8lHk",
      "text": "Flowers and vines temporarily grow around you; until your rage ends, the ground within 5 x your Rage Damage number of feet of you is difficult terrain for your enemies.",
      "img": "icons/svg/d20-black.svg",
      "documentId": null,
      "flags": {},
      "_key": "!tables.results!B253k6Z9q6SQsxLR.wEP3wLZtG9lj8lHk"
    },
    {
      "type": "text",
      "weight": 1,
      "range": [
        8,
        8
      ],
      "drawn": false,
      "_id": "UuQ2vvQNdGG2Aq6k",
      "text": "A bolt of light shoots from your chest. Another creature of your choice that you can see within 30 feet of you must succeed on a Constitution saving throw or take radiant damage equal the amount rolled on a number of d6 dice equal to your Rage Damage and be blinded until the start of your next turn. Until your rage ends, you can use this effect again on each of your turns as a bonus action.",
      "img": "icons/svg/d20-black.svg",
      "documentId": null,
      "flags": {},
      "_key": "!tables.results!B253k6Z9q6SQsxLR.UuQ2vvQNdGG2Aq6k"
    },
    {
      "type": "text",
      "weight": 1,
      "range": [
        9,
        9
      ],
      "drawn": false,
      "_id": "VGoLx418OHm7utjj",
      "text": "Until your rage ends, your Rage Damage is doubled.",
      "img": "icons/svg/d20-black.svg",
      "documentId": null,
      "flags": {},
      "_key": "!tables.results!B253k6Z9q6SQsxLR.VGoLx418OHm7utjj"
    },
    {
      "type": "text",
      "weight": 1,
      "range": [
        10,
        10
      ],
      "drawn": false,
      "_id": "cmy9frMksYlWVDh2",
      "text": "Until your rage ends, you become the target of any ranged attack against a target within 10 feet of you instead. You can use your reaction to ricochette a range attack when you are hit by it. When you do so, the damage you take from the attack is reduced by [[/r 1d12]] + barbarian levels + Rage Damage. If you reduce the damage to 0, you can richochette the attack targeting another creature of your choice that you can see or hear within 30 feet as part of the same reaction. The target must succeed a Dextierty saving throw or take the damage regardless of your weapon proficiencies or ability to cast spells.",
      "img": "icons/svg/d20-black.svg",
      "documentId": null,
      "flags": {},
      "_key": "!tables.results!B253k6Z9q6SQsxLR.cmy9frMksYlWVDh2"
    },
    {
      "type": "text",
      "weight": 1,
      "range": [
        11,
        11
      ],
      "drawn": false,
      "_id": "IhxNunR76fe1a6CJ",
      "text": "The space around you gets weird. Until your rage ends, any creature within 30 feet of you that has advanatge on any ability check, attack roll or saving throw rolls one addition d20 and takes the highest result. Alternatively, any creature within 30 feet of you that has disadvantage on any ability check, attack roll or saving throw rolls one additional d20 and takes the lowest result.",
      "img": "icons/svg/d20-black.svg",
      "documentId": null,
      "flags": {},
      "_key": "!tables.results!B253k6Z9q6SQsxLR.IhxNunR76fe1a6CJ"
    },
    {
      "type": "text",
      "weight": 1,
      "range": [
        12,
        12
      ],
      "drawn": false,
      "_id": "KzVvBf0WwBjZF4Ae",
      "text": "When you move on your turn in combat, gain a climbing speed, flying (hover) speed and swimming speed equal to your walking speed and double your speed until the end of the turn.",
      "img": "icons/svg/d20-black.svg",
      "documentId": null,
      "flags": {},
      "_key": "!tables.results!B253k6Z9q6SQsxLR.KzVvBf0WwBjZF4Ae"
    }
  ],
  "replacement": true,
  "displayRoll": true,
  "sort": 200000,
  "ownership": {
    "default": 0
  },
  "flags": {},
  "_stats": {
    "duplicateSource": null,
    "coreVersion": "12.328",
    "systemId": "dnd5e",
    "systemVersion": "3.2.1",
    "createdTime": 1721072889834,
    "modifiedTime": 1721073140660,
    "lastModifiedBy": "dnd5mbuilder0000"
  },
  "formula": "d12",
  "_key": "!tables!B253k6Z9q6SQsxLR"
}
