{
  "name": "Using Foundry",
  "_id": "matJrnUsingFound",
  "pages": [
    {
      "sort": 100000,
      "name": "Introduction",
      "type": "text",
      "_id": "bZooQmCS3snk4RGo",
      "system": {},
      "title": {
        "show": true,
        "level": 1
      },
      "image": {},
      "text": {
        "format": 1,
        "content": "<p>Materia D&amp;D is such a rich overhaul of 5th Edition that it can be difficult to keep track of all of the changes that have been made.  However, we've painstakingly taken the time to create as comprehensive a module for the Foundry VTT as possible to make it rather simple.  This section of the handbook details the recommended ways of using this module for both players and DMs alike.</p>"
      },
      "video": {
        "controls": true,
        "volume": 0.5
      },
      "src": null,
      "ownership": {
        "default": -1
      },
      "flags": {},
      "_stats": {
        "duplicateSource": null,
        "coreVersion": "12.331",
        "systemId": "dnd5e",
        "systemVersion": "4.1.2",
        "createdTime": 1732734615805,
        "modifiedTime": 1732734802101,
        "lastModifiedBy": "dnd5mbuilder0000"
      },
      "_key": "!journal.pages!matJrnUsingFound.bZooQmCS3snk4RGo"
    },
    {
      "sort": 200000,
      "name": "Character Creation",
      "type": "text",
      "_id": "Cqmp3fo4rYKONoXs",
      "system": {},
      "title": {
        "show": true,
        "level": 1
      },
      "image": {},
      "text": {
        "format": 1,
        "content": "<p>To create a Player Character in Materia D&amp;D following the @UUID[Compendium.materia-dnd.rules.JournalEntry.matJrnWelcome000.JournalEntryPage.VuTG3QwOLpKs2Lg4#custom-character-rules]{Custom Character Rules} outlined in the handbook, this module has added some helpful tools.</p><h3>Create Your Actor and Roll Stats</h3><p>To start, create your Player Character as usual in the Actors tab. When you first create the actor, you should see a button in the character sheet title bar that says \"Roll Stats\". Clicking this button brings up a custom Foundry application that will roll your stats according to the \"Character Creation Stat Rolls\" section of the Custom Character Rules for Materia. The instructions are repeated within the stat roller app itself, so you don't need to keep the ones in this handbook handy while doing so.</p><p>Once you have assigned your stats to your character, it is recommended that you then choose a species, though you can proceed with a background instead.</p><h3>Choose Your Species</h3><p>To select your species, simply click \"Add Species\" on the character sheet. This will bring up the Compendium Browser for species. Filter the \"Source\" for \"Materia D&amp;D 5.M\". Then you can search and select whatever species you like. If you'd like a reference for what each species does, check out the @UUID[Compendium.materia-dnd.rules.JournalEntry.matJrnSpecies000]{Species} portion of the handbook.</p><p>When you select your species, you will have to go through all the \"Advancement\" steps such as assigning stat points and such. Each species is designed according to the @UUID[Compendium.materia-dnd.rules.JournalEntry.matJrnSpecies000.JournalEntryPage.oH5RcBuFNp1pX9Xa]{Species Rules}, so be aware of those changes when doing so though largely the species itself will apply the appropriate restrictions or freedoms.</p><blockquote><p><strong>Note:</strong> Don't be afraid of making the wrong choices during this process, you can come back and redo your selections at any time after you've made them by right-clicking your Species and choosing \"Edit\", then going into the \"Advancement\" tab where you can choose to \"Edit Advancement\" on any individual selection.</p></blockquote><blockquote><p><strong>Additional Note:</strong> If you look into your species' \"Advancement\" tab you will notice advancements at levels 6, 12, and 18 that correspond to the benefits described in the \"Intelligence Bonus Benefits\" section of the House Rules portion of the handbook. If you need to alter these for some reason, they can be found here.</p></blockquote><p>Once the \"Advancement\" process is complete, you're done with your species and can move onto your background.</p><h3>Choose Your Background</h3><p>Choosing your backgroudn in Materia is essentially choosing which Level 1 feat you wish to have, as the backgrounds all correspond to one of the parent feats.  To add a background, click the \"Add Background\" section of your character sheet. As before with your species, it will bring up the Compendium Browser. Filter the \"Source\" for \"Materia D&amp;D 5.M\". You can search and select whichever background you like, or choose one of the three \"Custom Background\" options (they only differ in how many languages or tools you gain proficiency with).</p><p>When you make this selection, you will again have to go through the \"Advancement\" steps which grant your character all of the things provided by your background. The same note from the species section above applies -- don't be afraid to make selections that you will wish to change later during your character creation, these can be changed.</p><h3>Other Details</h3><p>The rest of the items on the Details tab, specifically your character's name and portrait, are done as usual with Foundry wih no special rules for Materia D&amp;D.</p><h3>Your 1st Level Class</h3><p>Assuming your DM wishes you to start at Level 1 or higher, the next thing you will want to do is go to the \"Features\" tab and add your class by clicking the \"Add Class\" button. As before, this brings up the Compendium Browser for classes so just filter for \"Materia D&amp;D 5.M\" and select one of the classes we provide as documented @UUID[Compendium.materia-dnd.rules.JournalEntry.matJrnClasses000.JournalEntryPage.xumDsH85X7KxLhTH]{here} in the handbook. Select your class and it will begin the \"Advancement\" process, starting with your level 1 HP, and then the featuers you get at level 1.</p><h4>Completing Level 1 Advancement</h4><p>From here, simply procede as usual, making selections where prompted. As part of the Level 1 class, the Materia D&amp;D module has incorporated starting equipment or any choices related to starting equipment. It doesn't currently allow you to opt for starting gold instead, so if you wish to do that simply remove all your starting items and replace it with the appropriate amount. Also, the \"packs\" (such as Scholar's Pack or Explorer's Pack) provided by some classes as starting equipment do not get added appropriately with the items inside so you will have to remove the one granted to you by the Level 1 class advancement and choose the appropriate one from the Items compendium.</p><h3>Additional Levels</h3><p>For any advancement beyond level 1, if you wish to take more levels in an existing class you will have to toggle your character sheet into edit mode using the wrench icon on the top left. Then, for the class you wish to level up simply change from the current level to your desired level. If you wish to add a new class via multiclassing, drag that class onto your character sheet from the Classes compendium (or open the Compendium browser to find them by filtering to \"Materia D&amp;D 5.M\" classes only). When multiclassing, make sure you meet the requirements of the new class first because the Foundry system will not automatically enforce them although it will grant the appropriate features when you do multiclass.</p>"
      },
      "video": {
        "controls": true,
        "volume": 0.5
      },
      "src": null,
      "ownership": {
        "default": -1
      },
      "flags": {},
      "_stats": {
        "duplicateSource": null,
        "coreVersion": "12.343",
        "systemId": "dnd5e",
        "systemVersion": "4.1.2",
        "createdTime": 1732734810011,
        "modifiedTime": 1747110150269,
        "lastModifiedBy": "dnd5mbuilder0000"
      },
      "_key": "!journal.pages!matJrnUsingFound.Cqmp3fo4rYKONoXs"
    },
    {
      "sort": 150000,
      "name": "Installation and Settings",
      "type": "text",
      "_id": "hh3ogzxcziZSgsBg",
      "system": {},
      "title": {
        "show": true,
        "level": 1
      },
      "image": {},
      "text": {
        "format": 1,
        "content": "<h2>Installation</h2><p>If you're seeing this message, you have successfully installed the Materia D&amp;D in the game world you are running.  So if this is the world you wish to use it in, you're done!  If you wish to use this in a different game world, you can install the module using this manifest link:</p><p><a href=\"https://github.com/materiadnd/materiadnd-foundryvtt/releases/latest/download/module.json\">Manifest for Latest Release</a></p><p>Because the material in the module is based off of much copyrighted material, this module is not intended for wide distribution via the Foundry module search.  Also, do not use this module as a means to circumvent purchasing the official 5th Edition material upon which this is based.  It is assumed if you are using this module, you own all of the core 5th Edition books and official Wizards of the Coast supplementary books.</p><h2>Settings</h2><p>Almost all of the settings for the Materia D&amp;D module are to toggle on or off individual components of the Materia D&amp;D overhaul.  It is recommended that you keep all of the features enabled, as they are by default, as that is what is the most tested.  However, if you dislike some of the features you may disable them individually.</p><p>The one non-toggle setting is a setting for the Spell Search, you can choose to point it to a custom compendium instead of the one that ships with this module.  Again, it is recommended that you leave it at its default value.</p>"
      },
      "video": {
        "controls": true,
        "volume": 0.5
      },
      "src": null,
      "ownership": {
        "default": -1
      },
      "flags": {},
      "_stats": {
        "duplicateSource": null,
        "coreVersion": "12.331",
        "systemId": "dnd5e",
        "systemVersion": "4.1.2",
        "createdTime": 1732734863388,
        "modifiedTime": 1732735247266,
        "lastModifiedBy": "dnd5mbuilder0000"
      },
      "_key": "!journal.pages!matJrnUsingFound.hh3ogzxcziZSgsBg"
    },
    {
      "sort": 300000,
      "name": "Customizing Your Character",
      "type": "text",
      "_id": "zrH4f649zlwgWNNk",
      "system": {},
      "title": {
        "show": true,
        "level": 1
      },
      "image": {},
      "text": {
        "format": 1,
        "content": "<h3>General Tips and Tricks</h3><ol><li><p>Any item that has been placed on your character sheet is specific to your character and can be edited as you see fit. This can be both a freedom and a responsibility. You can edit item names and descriptions to your liking, but you must be careful to not edit things that might affect how an item works. For example, don't remove any Activities from items unless you know what you are doing, as those contain the actions that an item can carry out or be used to carry out. But if you want to rename your Longsword to \"Joe-Bob's Longsword of Coolness\" then you can feel free to.</p></li><li><p>Since Materia D&amp;D tends to give Player Characters more toys to play with, it can be difficult to remember where each feature comes from. If you want, there is a macro in the Macro compendium for Materia D&amp;D titled \"Prefix Features with Prerequisites\". Using it with your character will update each feature to have more helpful feature names. For example, the feature \"Spellcasting\" that the first level in Wizard provides would be renamed to \"[Wizard 1] Spellcasting\" and the feature \"Bucking Mad\" provided by the Centaur species would become \"[Centaur] Bucking Mad\". Alternatively you can use the \"group\" control on the Features tab (looks like 3 sheets of paper in a stack) to group by origin.</p></li><li><p>The \"Favorites\" section of your character sheet will always be visible no matter what tab you are on, so it is very helpful. It can hold a reference to basically any item on your character sheet, just drag and drop into that area for easy availability.</p></li></ol><h3>Adding and Removing Items</h3><p>To find an item, whether it's an inventory item (weapon, armor, tool, etc.) or a spell or even a class or subclass, the best thing to use is the Compendium Browser. To open the Compendium Browser, click on the Compendium tab in the right-hand sidebar and click the \"Open Compendium Browser\" button. Use the tabs on the left to select the appropriate thing you are searching for. Then when you are searching, make <strong>sure</strong> you are filtering by \"Materia D&amp;D 5.M\" to get the proper version of whatever item you are looking for. Once you find the item you want, just drag it onto your character sheet.</p><p>To remove any item from your character sheet, you can either click the three-dots on the far-right side of that item and choose \"Delete\" or if you are in Edit mode of your character sheet a delete icon represented by a trash can will be present on each item.</p><h3>Using the Spell Search</h3><p>As part of the Foundry module for Materia D&amp;D, there is a custom \"Spell Search\" application provided that is intended to be an alternative, more featureful version to what the Compendium Browser provides.</p><h4>Accessing the Spell Search</h4><p>There are two ways to access this application:</p><ol><li><p>If your character has at least one spellcasting class, then the \"Spellcasting\" block at the top of your Spells list on your character sheet should have a search icon (a magnifying glass) with \"Spells\" next to it.  Clicking this will open the Spell Search app with filters applied for that spellcasting class.  It will filter it so that only that class's spells show as well as limiting it to the appropriate levels for that class.  If you are searching for spells for a certain character's spellcasting class <strong>this is the recommended way of opening it</strong>.</p></li><li><p>There is a button on the compendium sidebar tab titled \"Open Spell Search\", clicking it will open the Spell Search app with no filters applied.</p></li></ol><h4>Filtering Spells</h4><p>When the Spell Search app opens, the filters that can be applied are displayed at the top.  Each of the buttons at the top is a \"three-state\" button.  A grayed-out button (the default state) means this option is neither required nor disallowed, so spells that meet that filter can be in the results but not all results are required to meet that filter.  A blue button means this filter is required, so all spells in the results <strong>must</strong> meet this filter.  A red button means all results that match this filter will be excluded.  To toggle between the states, simply click the button and it will go through the states in that order.</p><p>There is also a text search available as well, this text search filters by spell name only.</p><h4>Search Results</h4><p>The results are displayed in alphabetical order by spell name, and the following fields are displayed:</p><ol><li><p>Spell Name</p></li><li><p>Spell Level</p></li><li><p>Cast Time</p></li><li><p>School of Magic</p></li><li><p>Which components of Verbal (V), Somatic (S), and Material (M) does the spell have</p></li><li><p>Is this a concentration spell?</p></li><li><p>Is this a ritual spell?</p></li><li><p>Spell Range</p></li></ol><p>The spell name results are \"enriched\" links so you can hover over them to see more details of the spell, click on them to open the spell, drag it to your character sheet to add it, or dragged into chat to link it.</p>"
      },
      "video": {
        "controls": true,
        "volume": 0.5
      },
      "src": null,
      "ownership": {
        "default": -1
      },
      "flags": {},
      "_stats": {
        "duplicateSource": null,
        "coreVersion": "12.331",
        "systemId": "dnd5e",
        "systemVersion": "4.1.2",
        "createdTime": 1732865323814,
        "modifiedTime": 1732868146636,
        "lastModifiedBy": "dnd5mbuilder0000"
      },
      "_key": "!journal.pages!matJrnUsingFound.zrH4f649zlwgWNNk"
    }
  ],
  "folder": null,
  "sort": 100000,
  "ownership": {
    "default": 0
  },
  "flags": {
    "dnd5e": {
      "type": "chapter",
      "position": 2
    }
  },
  "_stats": {
    "duplicateSource": null,
    "coreVersion": "12.331",
    "systemId": "dnd5e",
    "systemVersion": "4.1.2",
    "createdTime": 1732734602806,
    "modifiedTime": 1742166318974,
    "lastModifiedBy": "dnd5mbuilder0000"
  },
  "_key": "!journal!matJrnUsingFound"
}
