{
  "name": "Welcome",
  "_id": "nhxo1nXGOsM3usdA",
  "pages": [
    {
      "sort": 100000,
      "name": "Welcome to Materia",
      "type": "text",
      "_id": "eARfHNJbMr7xQEja",
      "system": {},
      "title": {
        "show": true,
        "level": 1
      },
      "image": {},
      "text": {
        "format": 1,
        "content": "<p>Welcome to Materia D&amp;D - where we play D&amp;D our way!  This world was created by Adam Owczarek for use with Dungeons &amp; Dragons to play and have fun in.  This module is meant to augment the D&amp;D 5th Edition system to bring it in line with the gameplay and content changes that are part of playing in this world.</p>"
      },
      "video": {
        "controls": true,
        "volume": 0.5
      },
      "src": null,
      "ownership": {
        "default": -1
      },
      "flags": {
        "materia-dnd": {
          "type": "chapter",
          "showPages": true,
          "position": 1
        }
      },
      "_stats": {
        "duplicateSource": null,
        "coreVersion": "12.331",
        "systemId": "dnd5e",
        "systemVersion": "4.1.1",
        "createdTime": 1732170291037,
        "modifiedTime": 1732170291037,
        "lastModifiedBy": "dnd5mbuilder0000"
      },
      "_key": "!journal.pages!nhxo1nXGOsM3usdA.eARfHNJbMr7xQEja"
    },
    {
      "sort": 200000,
      "name": "Changes from Standard D&D",
      "type": "text",
      "_id": "VuTG3QwOLpKs2Lg4",
      "system": {},
      "title": {
        "show": true,
        "level": 1
      },
      "image": {},
      "text": {
        "format": 1,
        "content": "<p>The Materia D&amp;D system will be comfortable to D&amp;D veterans but it does have a large number of customizations and changes. So much so that a module like this makes tracking these changes a much simpler option. To play like we do with Materia, you need to be aware of the following changes in addition to what is in this module.</p><h2>Variant Rules</h2><p>Materia D&amp;D uses the following Variant Rules:</p><ol><li><p>Milestone Experience (optional of course, but encouraged)</p></li><li><p>Flanking</p></li><li><p>Encumbrance (not necessarily a variant rule, but one not often observed)</p></li><li><p>Feats (using a custom Feat system described here)</p></li></ol><h2>House Rules</h2><p>Materia D&amp;D also uses a number of house rules for play.</p><h3>Custom Character Rules</h3><p>Player Character creation and advancement uses a handful of special rules, generally resulting in stronger characters throughout the adventure.</p><h4>Character Creation Stat Rolls</h4><p>Rolling your stats for character creation is required and follows a different set of rules than the Player's Handbook:</p><ol><li><p>Roll 4d6 7 times, dropping the lowest d6 from each set. Drop the lowest total from these 7 sets. These are your starting 6 stat rolls.</p></li><li><p>If you have no negative scores in this set, you <strong>must</strong> set one of the totals to 8. Alternatively if you wish to, you may choose to set any one of them to an 8. Setting one of your totals to an 8 allows you to re-roll one of the other totals. You <strong>must</strong> keep the result of this re-roll.</p></li><li><p>If your 6 stat totals add up to below 70, you may start over. Otherwise these are your 6 stats and you can assign them to whichever statistics you like.</p></li></ol><h4>Level 1 Feat</h4><p>All player characters get a feat at level 1 using the Materia feat system.</p><h4>Max HP First 3 Levels</h4><p>To make character durability a little more reliable early on, characters are granted max HP rolls at the first 3 levels, not just the first level. This takes the sting out of low HP rolls or even just having to settle for weak average rolls if you use those instead. It also means that Constitution isn't as big of a factor early on in your HP.</p><h4>Intelligence Bonus Benefits</h4><p>Since Intelligence is often a dump stat for any non-Intelligence based class, we decided to gift a little boon to those who decide to focus on studiousness and learning. At levels 6, 12, and 18 you can get an additional permanent benefit based upon what your Intelligence modifier is at the time you reach that level.</p><table><thead><tr><td>Intelligence Modifier</td><td>Bonus</td></tr></thead><tbody><tr><td><p>negative</p></td><td><p>None</p></td></tr><tr><td><p>+0</p></td><td><p><span style=\"font-family:'Roboto Condensed', sans-serif\">You gain proficiency in your choice of one gaming set or instrument or artisan tool.</span></p></td></tr><tr><td><p>+1</p></td><td><p><span style=\"font-family:'Roboto Condensed', sans-serif\">You gain proficiency in your choice of one gaming set or instrument or language or any tool proficiency.</span></p></td></tr><tr><td><p>+2</p></td><td><p><span style=\"font-family:'Roboto Condensed', sans-serif\">You gain proficiency in your choice of one gaming set or instrument or language or tool proficiency or skill from background, class, or species.</span></p></td></tr><tr><td><p>+3</p></td><td><p><span style=\"font-family:'Roboto Condensed', sans-serif\">You gain proficiency in your choice of one gaming set or instrument or language or tool proficiency or any skill.</span></p></td></tr><tr><td><p>+4</p></td><td><p><span style=\"font-family:'Roboto Condensed', sans-serif\">You gain proficiency in your choice of one gaming set or instrument or language or tool proficiency or any skill or expertise in one tool you are already proficient in.</span></p></td></tr><tr><td><p>+5 or higher</p></td><td><p><span style=\"font-family:'Roboto Condensed', sans-serif\">You gain proficiency in your choice of one gaming set or instrument or language or tool proficiency or any skill or expertise in one tool or expertise in one skill you are already proficient in.</span></p></td></tr></tbody></table><h4>Custom Feat System</h4><p>Materia uses a custom feat system described @UUID[Compendium.materia-dnd.rules.JournalEntry.Y3nNYIj2x7SCBVZm.JournalEntryPage.AkF6NnvMwMipS6y4]{here}.</p><h3>Custom Item Rules</h3><p>Materia items have a few changes to make the experience a grittier one but also to help streamline things in some ways.</p><h4>Bonus Action Potions</h4><p>When drinking a potion, it only requires a bonus action to do so. Administering a potion to an ally or other creature still requires an action to do so.</p><h4>Food/Ration Dependency</h4><p>Adventuring is hungry work, and for each long rest you must eat at least one substantive meal. This can be accounted for by one set of Rations, or if food can be obtained some other way. If you fail to eat a substantial enough portion of food prior to taking a long rest, you do not gain the benefit's of a long rest.</p><h4>Healer's Kit Dependency</h4><p>Recovering from battle and adventures takes more than just time. To recover HP during a short or long rest, you must use one charge from a healer's kit or other suitable set of medical supplies (at your DM's discretion). HP recovery from magical means such as a Bard's Song of Rest does not require the use of a healer's kit.</p><h4>Faster Attunement</h4><p>Any magical item that requires attunement may be attuned to as an Action and the attuned creature receives the attunement benefits immediately thereafter. Unattuning from an item still requires a short rest to do so.</p><h3>Custom Gameplay Rules</h3><p>Materia gameplay is focused on gritty adventures that can be punishing but also very rewarding at the same time.</p><h4>Brutal Criticals</h4><p>Instead of rolling double the damage dice for a critical hit, every die that would be rolled for damage as part of the critical hit is instead treated as the maximum value and <strong>added </strong>to the normal damage roll. For example, a critical hit with a dagger would deal 1d4 + 4 damage on top of whatever other modifiers are applied. Other damage dice that apply to the attack such as a Rogue's Sneak Attack follow this rule, for example a level 1 rogue who lands a critical hit with Sneak Attack would deal an additional 1d6 + 6 damage.</p><h4>15 Feet Standing From Prone</h4><p>Standing from prone always uses 15 feet of your movement instead of half your movement speed. This is intended to be less punishing to characters who have invested in more movement.</p><h4>Opportunity Attacks When Standing From Prone</h4><p>Standing from prone provokes attacks of opportunity to any enemies that are within reach of their weapons or unarmed strikes. It's not trivial to right yourself from prone without opening yourself up to weakness after all! You can always Disengage if you wish.</p><h4>Hidden Death Save Rolls</h4><p>When a player character must make a death save, the DM instead rolls it and notes down the result without telling the player or the party. This is intended to make being at death's door a truly dangerous proposition and one that cannot easily be metagamed.</p><h4>KO Exhaustion</h4><p>Getting knocked unconscious should be consequential and avoided if at all possible. To make this the case, when a player character drops to 0 HP, they suffer a level of exhaustion. This is meant to discourage the \"yo-yo\" gameplay style where characters can be knocked unconscious and brought back via healing with little consequence.</p><h4>Enhanced Exhaustion</h4><p>Materia uses a custom exhaustion system which is intended to make it a bit more consistently punishing. It is described in the @UUID[Compendium.materia-dnd.rules.JournalEntry.MpEv2KTNEY6lLelV.JournalEntryPage.9XAWvL8gnCtdez6U]{Conditions} section.</p><h2>Custom Content</h2><p>The major overhauls done within the Materia D&amp;D system are updated content which rebalances and expands the options available to DMs and players alike:</p><ul><li><p>Updated @UUID[Compendium.materia-dnd.rules.JournalEntry.H76xJMaOJFmWpDIm]{Classes} including the brand new Warlord class</p></li><li><p>Updated Spells including several brand new spells</p></li><li><p>Updated @UUID[Compendium.materia-dnd.rules.JournalEntry.JdwOhT3YaGkNzLIr]{Species} including dozens of new or reimagined species</p></li><li><p>Updated @UUID[Compendium.materia-dnd.rules.JournalEntry.pqZvXeOv4VSMZilx]{Equipment} including the @UUID[Compendium.materia-dnd.rules.JournalEntry.nniVtdJB1oyk5Sa3]{Locus} system which is meant to enhance magical items at middle-tier gameplay and later</p></li></ul>"
      },
      "video": {
        "controls": true,
        "volume": 0.5
      },
      "src": null,
      "ownership": {
        "default": -1
      },
      "flags": {},
      "_stats": {
        "duplicateSource": null,
        "coreVersion": "12.331",
        "systemId": "dnd5e",
        "systemVersion": "4.1.1",
        "createdTime": 1732170496060,
        "modifiedTime": 1732173726181,
        "lastModifiedBy": "dnd5mbuilder0000"
      },
      "_key": "!journal.pages!nhxo1nXGOsM3usdA.VuTG3QwOLpKs2Lg4"
    }
  ],
  "folder": null,
  "sort": 0,
  "ownership": {
    "default": 0
  },
  "flags": {},
  "_stats": {
    "duplicateSource": null,
    "coreVersion": "12.331",
    "systemId": "dnd5e",
    "systemVersion": "4.1.1",
    "createdTime": 1732170278193,
    "modifiedTime": 1732170278193,
    "lastModifiedBy": "dnd5mbuilder0000"
  },
  "_key": "!journal!nhxo1nXGOsM3usdA"
}