{
    "materia-dnd": {
        "settings": {
            "add-armor-types": {
                "Name": "Add Materia armor types?",
                "Hint": "Enable to include the custom armor types from Materia D&D 5.M"
            },
            "add-materia-conditions": {
                "Name": "Add Materia conditions?",
                "Hint": "Enable to include the updated conditions from Materia D&D 5.M"
            },
            "add-third-pact-caster": {
                "Name": "Add third pact caster?",
                "Hint": "Enable to include the one-third pact caster, needed for Order of the Profane Soul Blood Hunter"
            },
            "add-weapons-and-weapon-props": {
                "Name": "Add Materia weapons and updated properties?",
                "Hint": "Enable to include the weapon updates from Materia D&D 5.M"
            },
            "add-spell-prep-counter": {
                "Name": "Add spell preparation counter to PC character sheets?",
                "Hint": "Enable to include the spell preparation counter on the spellbook tab of player characters"
            },
            "add-exhaustion-handling": {
                "Name": "Enable automatic exhaustion handling?",
                "Hint": "If enabled, will automatically handle exhaustion from a PC hitting 0 HP"
            },
            "auto-item-use-tracker-enabled": {
                "Name": "Enable automatic item-use linking?",
                "Hint": "If enabled, will automatically update the 'Item Uses' for things like Maneuvers"
            },
            "wild-shape-transform-handler-enabled": {
                "Name": "Enable wild shape transformation handler?",
                "Hint": "If enabled, will handle the Materia D&D 5.M transformation rules for its templates."
            },
            "enable-item-restore": {
                "Name": "Enable 'Item Restore' button on items?",
                "Hint": "If enabled, will place a button for restoring/updating items to the module latest version on item sheets for items belonging to a PC"
            },
            "replace-source-packs": {
                "Name": "Replace source packs on PC sheets with Materia source packs?",
                "Hint": "If enabled, will replace the DND5E source packs that open when you click Add buttons on PC sheets."
            },
            "enable-spell-search": {
                "Name": "Enable spell search?",
                "Hint": "If enabled, will turn on spell search application for the compendium specified."
            },
            "spell-search-pack-name": {
                "Name": "Compendium name for spell search",
                "Hint": "The name of the compendium you wish to use for the Spell Search application."
            },
            "show-starting-stat-roller": {
                "Name": "Show button for starting stat roller?",
                "Hint": "If enabled, will show a button for starting stat roller app on new characters."
            }
        },
        "ui": {
            "item-restore": {
                "itemsheet-titlebar-button": "Restore",
                "buttons": {
                    "restore-item": "Restore to Current Version"
                }
            },
            "stat-roller": {
                "charsheet-titlebar-button": "Roll Stats",
                "buttons": {
                    "roll-starting-stats": "Roll starting stats",
                    "set-stat-to-eight": "Set stat to 8",
                    "reroll-one-stat": "Reroll one stat",
                    "start-over": "Start over",
                    "assign-stats": "Assign stats"
                },
                "messages": {
                    "starting-rolls": "Click button to roll your starting stats.  It will roll seven sets of stats, using 4d6 but only keeping the highest 3 for each.  The lowest of the seven rolls will be ignored.",
                    "post-starting-rolls": "After your initial rolls, if none of your rolls total below 10, you must choose to set one stat to an 8.  This will allow you to re-roll another stat one more time for free using the same 4d6 keep highest 3 method from before.  If you already have one stat below a 10, you can choose to finish by assigning your stats to individual attributes.",
                    "setting-an-eight": "Select the roll which you would like to set to an 8.",
                    "after-setting-eight": "You may now choose to re-roll another stat, but you must take the result of the re-roll.",
                    "after-reroll-valid-stats": "You must now choose which attribute to assign each stat to and click the button to assign them.",
                    "after-reroll-invalid-stats": "Your stat total is below 70, you must start the process over."
                }
            }
        }
    },
    "DND5E.RaceAdd": "Add Species",
    "DND5E.AdvancementAbilityScoreImprovementFeatHint": "Drop a top-level feat here to choose one instead of an ability score improvement, you will have to add the bullets manually afterward."

}